Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: And Peter said to Jesus, Master, it is good for us to be here: and let us make three tents; one for you, one for Moses, and one for Elijah.
chr: ᏈᏓᏃ ᎤᏁᏨ ᎯᎠ ᏄᏪᏎᎴ ᏥᏌ, ᏔᏕᏲᎲᏍᎩ, ᎣᏏᏳ ᎠᏂ ᏥᏕᏙᎭ; ᎠᎴ ᏦᎢ ᏫᏙᏥᎵᏦᏛᎦ; ᏌᏉ ᏂᎯ ᏣᏤᎵᎦ, ᏌᏉᏃ ᎼᏏ ᎤᏤᎵᎦ, ᏌᏉᏃ ᎢᎳᏯ ᎤᏤᎵᎦ.

source: Because he was not certain what to say, for they were in great fear.
chr: ᎥᏝᏰᏃ ᏯᎦᏔᎮ ᎢᏳᏪᏍᏗᏱ; ᎤᏣᏘᏰᏃ ᎠᏂᏍᎦᎢᎮᎢ.

source: And a cloud came over them; and a voice came out of the cloud, saying, This is my dearly loved Son, give ear to him.
chr: ᎤᎶᎩᎸᏃ ᎤᏄᏢᏔᏁᎢ; ᎧᏁᎬᏃ ᎤᎶᎩᎸ ᏧᎾᏄᎪᏤᎢ, ᎯᎠ ᏂᎦᏪᏍᎨᎢ, ᎯᎠ ᎾᏍᎩ ᏥᎨᏳᎢ ᎠᏇᏥ; ᎾᏍᎩ ᎡᏣᏛᏓᏍᏓᏏ.

source: And suddenly looking round about, they saw no one any longer, but Jesus only with themselves.
chr: ᎩᎳᏉᏃ ᎢᏴᏛ ᏚᎾᎧᎿᏂᏙᎸ, ᎥᏝ ᎿᏉ ᎩᎶ ᏳᏂᎪᎮᎢ, ᏥᏌ ᎤᏩᏒ, ᎠᎴ ᎤᏅᏒ.

source: And while they were coming down from the mountain, he gave them orders not to give word to any man of the things they had seen, till the Son of man had come back from the dead.
chr: ᏧᏂᎦᏐᎠᏏᏗᏒᏃ ᎣᏓᎸᎢ, ᏚᏁᏤᎴ ᎾᏍᎩ ᎩᎶ ᎤᏂᏃᏁᏗᏱ ᏂᎨᏒᎾ ᏄᏍᏛ ᎤᏂᎪᎲᎢ, ᎬᏂ ᏴᏫ ᎤᏪᏥ ᎤᏲᎱᏒ ᏧᎴᎯᏌᏅᎯ ᎨᏎᏍᏗ ᏚᏬᏎᎴᎢ.

source: And they kept the saying, questioning among themselves what the coming back from the dead might be.
chr: ᎾᏍᎩᏃ ᏄᏪᏒ ᎤᎾᎦᏌᏯᏍᏔᏁᎢ, ᏓᎾᏓᏛᏛᎲᏍᎨ ᎦᏛᎬ ᎠᏲᎱᏒ ᏗᎴᎯᏐᏗ ᎨᏒᎢ.

source: And they put a question to him, saying, Why do the scribes say that Elijah has to come first?
chr: ᎬᏩᏛᏛᏁᏃ ᎯᎠ ᏄᏂᏪᏎᎢ, ᎦᏙᏃ ᏗᏃᏪᎵᏍᎩ ᎢᎳᏯ ᎢᎬᏱ ᏓᎦᎷᏥ ᏣᎾᏗᏍᎪᎢ?

source: And he said to them, Truly, Elijah does come first, and puts all things in order; and how is it said in the Writings that the Son of man will go through much sorrow and be made as nothing?
chr: ᎤᏁᏨᏃ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎢᎳᏯ ᎤᏙᎯᏳᎯ ᎢᎬᏱ ᎤᎷᎯᏍᏗ, ᎠᎴ ᏂᎦᏛ ᎤᏬᏢᎯᏐᏗ; ᎠᎴ ᎾᏍᏉ ᎯᎠ ᏂᎬᏅᎪᏪᎳ ᏴᏫ ᎤᏪᏥ ᎠᏥᏃᎮᏍᎬᎢ, ᎾᏍᎩ ᎤᏣᏘ ᏧᏓᎴᏅᏛ ᎤᎩᎵᏲᎢᏍᏗ ᎨᏎᏍᏗ, ᎠᎴ ᎠᏎᏉ ᏓᏰᏥᏰᎸᏂ.

source: But I say to you that Elijah has come, and they have done to him whatever they were pleased to do, even as the Writings say about him.
chr: ᎠᏎᏃ ᎯᎠ ᏂᏨᏪᏎᎭ, ᎢᎳᏯ ᎤᏙᎯᏳᎯ ᎤᎷᏨ, ᎠᎴ ᏄᏍᏛ ᎤᎾᏚᎵᏍᎬ ᏂᎬᏩᏁᎸ, ᎾᏍᎩᏯ ᏂᎬᏅ ᎪᏪᎸ ᎾᏍᎩ ᎠᏥᏃᎮᏍᎬᎢ.

source: And when they came to the disciples, they saw a great mass of people about them, and scribes questioning them.
chr: ᎬᏩᏍᏓᏩᏗᏙᎯᏃ ᎠᏁᏙᎲ ᎤᎷᏨ, ᎤᏂᏣᏘ ᏚᎪᎮ ᎬᏩᎾᏓᏡᏫᏍᏕᎢ, ᎠᎴ ᏗᏃᏪᎵᏍᎩ ᎬᏩᎾᏛᏛᎮᎸᎢᏍᎨᎢ.

source: And straight away all the people, when they saw him, were full of wonder, and running to him, gave him worship.
chr: ᎩᎳᏉᏃ ᎢᏴᏛ ᏂᎦᏛ ᏴᏫ, ᎬᏩᎪᎲ, ᎤᏣᏘ ᎤᏂᏍᏆᏂᎪᏎᎢ; ᎬᏩᏗᏝᎣᎮᎸᏃ ᎬᏩᏲᎵᎴᎢ.

source: And he said, What are you questioning them about?
chr: ᏚᏛᏛᏁᏃ ᏗᏃᏪᎵᏍᎩ, ᎦᏙ ᏕᏣᏛᏛᎮᎸᎥᏍᎦ ᏚᏬᏎᎴᎢ?

source: And one of the number said to him in answer, Master, I came to you with my son, who has in him a spirit which takes away his power of talking;
chr: ᎠᏏᏴᏫᏃ ᎾᏍᎩ ᎤᏂᏣᏘ ᎨᏒ ᎨᎳ ᎤᏁᏨ ᎯᎠ ᏄᏪᏎᎢ, ᏔᏕᏲᎲᏍᎩ, ᎬᏯᏘᏃᎯᏏ ᎠᏇᏥ, ᎤᏩᎨᏫ ᎠᏓᏅᏙ ᎤᏪᎢ;

source: And wherever it takes him, it puts him down violently, streaming at the lips and twisted with pain; and his strength goes from him; and I made a request to your disciples to send it out, and they were not able.
chr: ᎢᎸᎯᏢᏃ ᎤᏱᎶᎯᏏ ᎤᎩᎸᏍᎪᎢ; ᎠᎴ ᏓᎭᏬᎢᎰᎢ, ᎠᎴ ᏕᎦᎸᏓᎩᏍᎪ ᏕᎦᏄᏙᎬᎢ, ᎠᎴ ᎤᎸᏕᎯᎰᎢ; ᎨᏣᏍᏓᏩᏗᏙᎯᏃ ᎦᏥᏔᏲᏎᎸ ᎤᏂᏄᎪᏫᏍᏗᏱ; ᎠᏎᏃ ᎤᏂᏄᎸᏅᏉ.

source: And he said to them in answer, O generation without faith, how long will I have to be with you? how long will I put up with you? let him come to me.
chr: ᎤᏁᏤᎸᏃ, ᎯᎠ ᏄᏪᏎᎢ, Ᏺ! ᏂᏦᎯᏳᏒᎾ ᎪᎯ ᏥᏤᎭ! ᎢᎳᎪ ᎢᎪᎯᏛ ᎢᏨᏰᎳᏗᏙᎮᏍᏗ? ᎢᎳᎪ ᎢᎪᎯᏛ ᎤᏁᎳᎩ ᎢᏨᏰᎵᏎᎮᏍᏗ? ᎠᏂ ᎯᏯᏘᏃᎦ.

source: And they took him to him: and when he saw him, the spirit in him straight away became violent; and he went down on the earth, rolling about and streaming at the lips.
chr: ᎤᎾᏘᏃᎮᎴᏃ; ᎤᎪᎲᏃ ᎩᎳᏉ ᎢᏴᏛ ᎠᏓᏅᏙ ᎤᎩᎸᏁᎢ; ᎡᎳᏗᏃ ᎤᏅᏤᎢ, ᎠᎴ ᏓᎭᏬᎢᎲ ᎠᎵᏗᏒᏂᎮᎢ.

source: And Jesus questioning the father said, How long has he been like this? And he said, From a child.
chr: ᎤᏛᏛᏁᏃ ᎤᏙᏓ, ᎢᎳᎪ ᏂᎪᎯᎩ ᎾᏍᎩ ᎯᎠ ᎢᎬᏩᎵᏍᏓᏁᎸᎯ? ᎤᏬᏎᎴᎢ. ᎠᏲᎵᏉ ᎨᏒᎢ, ᎤᏛᏁᎢ;

source: And frequently it has sent him into the fire and into the water, for his destruction; but if you are able to do anything, have pity on us, and give us help.
chr: ᏯᏃᎩᏳᏃ ᎠᏥᎸᏱ ᎠᎴ ᎠᏑᏱ ᎤᏓᎡᎪᎢ, ᎾᏍᎩ ᎤᎯᏍᏗᏱ; ᎢᏳᏍᎩᏂᏃᏅ ᎪᎱᏍᏗ ᎨᏣᏛᏁᏗ ᎨᏎᏍᏗ, ᏍᎩᏍᏙᎵᎩ, ᎠᎴ ᏍᎩᏍᏕᎸ.

source: And Jesus said to him, If you are able! All things are possible to him who has faith.
chr: ᏥᏌᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎢᏳᏃ ᎨᏦᎯᏳᏗ ᎨᏎᏍᏗ, ᏂᎦᏗᏳ ᎪᎱᏍᏗ ᎢᎦᏰᎦᏛᏁᏗ ᎪᎯᏳᎲᏍᎩ.

source: Straight away the father of the child gave a cry, saying, I have faith; make my feeble faith stronger.
chr: ᎩᎳᏉᏃ ᎢᏴᏛ ᎠᏲᎵ ᎤᏙᏓ ᎤᏪᎷᏁᎢ, ᎠᎴ ᏗᎬᎦᏌᏬᎢᎯ ᎯᎠ ᏄᏪᏎᎢ, ᏣᎬᏫᏳᎯ, ᎪᎢᏳᎲᏍᎦ; ᏍᎩᏍᏕᎸᏏ ᎾᏉᎯᏳᏒᎾ ᎨᏒᎢ.

source: And when Jesus saw that the people came running together, he gave orders to the unclean spirit, saying to him, You, spirit, who are the cause of his loss of voice and hearing, I say to you, come out of him, and never again go into him.
chr: ᏥᏌᏃ ᎤᎪᎲ ᎾᏍᎩ ᎤᏂᏣᏘ ᎠᎾᏁᎷᎩᏍᎬ ᎠᎾᏓᏟᏏᏍᎬᎢ, ᎤᏍᎦᏤ ᎦᏓᎭ ᎠᏓᏅᏙ, ᎯᎠ ᏄᏪᏎᎴᎢ, ᏨᎨᏩ ᎠᎴ ᏗᏣᎵᎡᎾ ᎠᏓᏅᏙ, ᎬᏁᏤᎭ, ᎡᎯᏄᎪᎢ, ᎠᎴ ᏞᏍᏗ ᎿᏉ ᎢᎸᎯᏳ ᏥᎯᏴᎵ.

source: And after crying out and shaking him violently, it came out: and the child became like one dead; so that most of them said, He is dead.
chr: [ᎠᏓᏅᏙᏃ] ᎤᏪᎷᏅ, ᎠᎴ ᎤᏣᏘ ᎤᎩᎸᏅ, ᎤᏄᎪᏤᎢ; ᎠᎴ ᎤᏲᎱᏒᎯᏉ ᎾᏍᎩᏯ ᎨᏎᎢ; ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᏂᏣᏖ, ᎠᏲᎱᎯ, ᎠᎾᏗᏍᎨᎢ.

source: But Jesus took him by the hand, lifting him up; and he got up.
chr: ᎠᏎᏃ ᏥᏌ ᎤᏬᏯᏁᏒ, ᏚᎴᏔᏁᎢ, ᎠᎴ ᏚᎴᏁᎢ.

source: And when he had gone into the house, his disciples said to him privately, Why were we unable to send it out?
chr: ᎦᎵᏦᏕᏃ ᏫᎤᏴᎸ, ᎬᏩᏍᏓᏩᏗᏙᎯ ᎤᏅᏒ ᎨᏒ ᎬᏩᏛᏛᏁᎢ, ᎦᏙᏃ ᎠᏴ ᎥᏝ ᎦᏲᏥᏄᎪᏫᏍᏗ ᏱᎨᏎᎢ? ᎤᎾᏛᏁᎢ.

source: And he said to them, Nothing will make this sort come out but prayer.
chr: ᎯᎠᏃ ᏂᏚᏪᏎᎴᎢ, ᎯᎠ ᎾᏍᎩ ᎢᏳᏍᏗ ᎥᏝ ᏴᎦᏰᎦᏄᎪᏩ, ᎬᏂ ᎠᏓᏙᎵᏍᏔᏅᎯ ᎠᎴ ᎠᎹᏟ ᎬᏅᎯ ᏥᎨᏐᎢ.

source: And they went out from there, through Galilee; and it was his desire that no man might have knowledge of it;
chr: ᎤᎾᏂᎩᏒᏃ ᎾᎿᏂ, ᎨᎵᎵ ᎠᏰᎵ ᎤᏂᎶᏎᎢ; ᎥᏝᏃ ᏳᏚᎵᏍᎨ ᎩᎶ ᎤᏙᎴᎰᎯᏍᏗᏱ.

source: For he was giving his disciples teaching, and saying to them, The Son of man is given up into the hands of men, and they will put him to death; and when he is dead, after three days he will come back from the dead.
chr: ᏚᏪᏲᏁᏰᏃ ᎬᏩᏍᏓᏩᏗᏙᎯ, ᎠᎴ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᏴᏫ ᎤᏪᏥ ᏓᏥᏲᎯ ᏕᎨᏥᏲᎯᏏ ᏴᏫ. ᎠᎴ ᏓᎬᏩᎵ; ᎠᎴ ᎣᏂ ᎿᏉ ᎠᏥᎸᎯ ᎨᏎᏍᏗ, ᏙᏛᎠᎴᎯᏌᏂ ᏦᎢᏁ ᎢᎦ.

source: But the saying was not clear to them, and they were in fear of questioning him about it.
chr: ᎠᏎᏃ ᎥᏝ ᏳᏃᎵᏤ ᎾᏍᎩ ᏄᏪᏒ ᎠᎴ ᎠᏂᏍᎦᎢᎮ ᎤᎾᏛᏛᏗᏱ.

source: And they came to Capernaum: and when he was in the house, he put the question to them, What were you talking about on the way?
chr: ᎨᏆᏂᏃ ᎤᎷᏥᎴᎢ; ᎦᎵᏦᎦᏃ ᎠᏯᎥ ᏚᏛᏛᏁ, ᎦᏙ ᎾᏍᎩ ᏥᏥᏃᎮᏍᎬ ᎢᏨᏒ ᎨᏒ Ꭰ ᏗᏓᎢᏒᎢ.

source: But they said nothing: because they had had an argument between themselves on the way, about who was the greatest.
chr: ᎠᏎᏃ ᎡᎳᏪᏱᏉ ᎤᏅᏎᎢ; ᏗᎾᎢᏒᏃ ᎠᏂᏃᎮᏍᎨ ᎤᏅᏒ ᎨᏒ ᎾᏍᎩ ᎤᏟ ᎠᏥᎸᏉᏗᏳ ᎨᏒᎢ.

source: And seating himself, he made the twelve come to him; and he said to them, If any man has the desire to be first, he will be last of all and servant of all.
chr: ᎤᏪᏅᏃ, ᏔᎳᏚ ᎢᏯᏂᏛ ᏫᏚᏯᏅᎮᎢ, ᎠᎴ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎢᏳᏃ ᎩᎶ ᎢᎬᏱ ᎢᏳᎵᏍᏙᏗᏱ ᎤᏚᎵᏍᎨᏍᏗ, ᎾᏍᎩ ᎣᏂᏱ ᎠᎦᎴᏙᏗ ᎨᏎᏍᏗ ᎾᏂᎥᎢ, ᎠᎴ ᎾᏂᎥ ᎬᏩᏅᏏᏙᎯ ᎨᏎᏍᏗ.

source: And he took a little child, and put him in the middle of them; and taking him in his arms, he said to them,
chr: ᎠᏲᎵᏃ ᏭᏯᏅᎲ, ᎠᏂᏅ ᎠᏰᎵ ᎤᏪᎧᏁᎢ; ᎤᏄᎶᎸᏃ ᎯᎠ ᏂᏚᏪᏎᎴᎢ,

source: Whoever will give honour to one such little child in my name, gives honour to me: and whoever gives honour to me, gives honour not to me, but to him who sent me.
chr: ᎩᎶ ᎠᏏᏴᏫ ᎯᎠ ᎢᏳᎾᏍᏗ ᏗᏂᏲᎵ ᏓᏓᏂᎸᎨᏍᏗ ᎠᏴ ᎠᏴ ᏓᏆᏙᎥ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᏍᏗ, ᎠᏴ ᏓᏆᏓᏂᎸᎨᏍᏗ; ᎩᎶᏃ ᎠᏴ ᏓᏆᏓᏂᎸᎨᏍᏗ, ᎥᏝ ᎠᏴ ᏱᏓᏆᏓᏂᎸᎨᏍᏗ, ᏅᏛᎩᏅᏏᏛᏍᎩᏂ ᏓᏓᏂᎸᎨᏍᏗ.

source: John said to him, Master, we saw one driving out evil spirits in your name: and we said that he might not, because he is not one of us.
chr: ᏣᏂᏃ ᎤᏁᏤᎴᎢ, ᎯᎠ ᏄᏪᏎᎢ, ᏔᏕᏲᎲᏍᎩ, ᎣᏥᎪᎲᎩ ᎠᏏᏴᏫ ᎠᏂᏍᎩᎾ ᏕᎦᏄᎪᏫᏍᎬᎩ ᏕᏣᏙᎥ ᎬᏗᏍᎬᎩ; ᎥᏝᏃ ᏱᎩᏍᏓᏩᏗᏙᎭ; ᎣᏥᏅᏍᏓᏕᎸᎩᏃ ᏂᎩᏍᏓᏩᏕᎬᎾ ᎨᏒ ᎢᏳᏍᏗ.

source: But Jesus said, Say not so: for there is no man who will do a great work in my name, and be able at the same time to say evil of me.
chr: ᎠᏎᏃ ᏥᏌ ᎯᎠ ᏄᏪᏎᎢ, ᏞᏍᏗ ᎡᏥᏅᏍᏓᏕᎸᎩ; ᎥᏝᏰᏃ ᏰᎭ ᎩᎶ ᏓᏆᏙᎥ ᎬᏗᏍᎩ ᎤᏍᏆᏂᎪᏗ ᏧᎸᏫᏍᏓᏁᎯ, ᎾᏍᎩ ᎢᎬᏪᏅᏛ ᎤᏐᏅ ᎬᎩᏁᎢᏍᏙᏗ.

source: He who is not against us is for us.
chr: ᎩᎶᏰᏃ ᎾᏍᎩ ᏂᎦᏡᏗᏍᎬᎾ ᏥᎨᏐ, ᎾᏍᎩ ᎢᎦᎵᎪᏁᎯ ᎨᏐᎢ.

source: Whoever gives you a cup of water, because you are Christ's, truly I say to you, he will in no way be without his reward.
chr: ᎩᎶᏰᏃ ᎠᎹ ᎤᎵᏍᏈᏗ ᎠᎧᎵᎢ ᎢᏣᏗᏔᏍᏗ ᎢᏥᏁᏁᎯ ᎠᏴ ᏓᏆᏙᎥ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᏍᏗ, ᎦᎶᏁᏛ ᎡᏣᏤᎵ ᎨᏒ ᎢᏳᏍᏗ, ᎤᏙᎯᏳᎯᏯ ᎢᏨᏲᏎᎭ, ᎥᏝ ᎤᏲᎱᏎᏗ ᏱᎨᏎᏍᏗ ᎠᎦᎫᏴᎡᏗ ᎨᏒᎢ.

source: And whoever is a cause of trouble to one of these little ones who have faith in me, it would be better for him if a great stone was put round his neck and he was dropped into the sea.
chr: ᎠᎴ ᎩᎶ ᎠᏏᏴᏫ ᎯᎠ ᏧᎾᏍᏗ ᎨᏒ ᎾᏍᎩ ᏥᎬᏉᎯᏳᎲᏍᎦ ᏙᎪᏕᏍᏗᏍᎨᏍᏗ, ᎤᏟ ᎣᏏᏳ ᎢᏳᎵᏍᏓᏁᏗ ᎠᏍᏙᏍᎩ ᏅᏯ ᏯᏥᏯᏝᏅ, ᎠᎴ ᎠᎺᏉᎯ ᏱᏩᎦᏓᎢᏅ.

source: And if your hand is a cause of trouble to you, let it be cut off; it is better for you to go into life with one hand than to have two hands and go into hell, into the eternal fire.
chr: ᎢᏳ ᎠᎴ ᏦᏰᏂ ᏕᏦᏕᏍᏗᏍᎨᏍᏗ, ᎯᏍᏆᎵᏍᎨᏍᏗ; ᎤᏟ ᎣᏏᏳ ᎢᏣᎵᏍᏓᏁᏗ ᏣᎪᎳᏂ ᎬᏂᏛ ᏗᎨᏒ ᏱᏫᏣᏴᎸ, ᎠᏃ ᎢᏧᎳ ᏗᎨᎰᏯᏗ ᏨᏍᎩᏃ ᏱᏫᏣᏴᎸ, ᎾᎿ ᎠᏥᎸᏱ ᎦᎬᏜᏗᏍᏗ ᏂᎨᏒᎾ;

source: And if your foot is a cause of trouble to you, let it be cut off: it is better for you to go into life with one foot than to have two feet and go into hell.
chr: ᎢᏳ ᎠᎴ ᏣᎳᏏᏕᏂ ᏙᏦᏕᏍᏗᏍᎨᏍᏗ, ᎯᏍᏆᎵᏍᎨᏍᏗ; ᎤᏟᏰᏃ ᎣᏏᏳ ᎢᏣᎵᏍᏓᏁᏗ ᎯᏲᎤᎵ ᎬᏂᏛ ᏗᎨᏒ ᏱᏫᏣᏴᎸ, ᎠᏃ ᎢᏧᎳ ᏗᎨᏣᎳᏍᎩ ᏨᏍᎩᏃ ᏱᏪᏣᏓᎢᏅ, ᎾᎿ ᎠᏥᎸᏱ ᎦᎬ ᏜᏗᏍᏗ ᏂᎨᏒᎾ;

source: And if your eye is a cause of trouble to you, take it out: it is better for you to go into the kingdom of God with one eye than, having two eyes, to go into hell,
chr: ᎢᏳ ᎠᎴ ᎯᎦᏙᎵ ᏙᏦᏕᏍᏗᏍᎨᏍᏗ, ᎭᏓᎦᏖᏙᎢᏍᎨᏍᏗ; ᎤᏟᏰᏃ ᎣᏏᏳ ᎢᏣᎵᏍᏓᏁᏗ ᏌᏉᏉ ᏱᎧᏅ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎪᎯ ᏱᏫᏣᏴᎸ ᎠᏃ ᎢᏧᎳ ᏱᏘᎧᏅ ᏨᏍᎩᏃ ᎠᏥᎸᏱ ᏱᏪᏣᏓᎢᏅ;

source: Where their worm is ever living and the fire is not put out.
chr: ᎾᎿ ᎤᎾᏤᎵ ᏥᏍᎪᏴ ᏂᎦᎵᏬᎬᎾ ᏗᎨᏒᎢ, ᎠᎴ ᎠᏥᎸ ᏂᎬᏠᏍᎬᎾ ᏗᎨᏒᎢ.

source: Everyone will be salted with fire.
chr: ᎾᏂᎥᏰᏃ ᎠᏥᎸ ᎬᏗ ‾ᎠᎹ ᎨᏥᏅᏝᏰᏗ ᎨᏎᏍᏗ, ᎠᎴ ᏂᎦᎥ ᎠᏥᎸ-ᎨᎳᏍᏗ ‾ᎠᎹ ᎦᏅᎵᏰᏗ ᎨᏎᏍᏗ.

source: Salt is good; but if the taste goes from it, how will you make it salt again? Have salt in yourselves, and be at peace one with another.
chr: ᎠᎹ ᎣᏏᏳ; ᎠᏎᏃ ‾ᎠᎹ ᏳᏥᏍᎪᎸ ᎦᏙ ᏱᏨᎦ ᏄᏥᏍᎪᎸᎾ ᏱᏂᏨᎦ? ‾ᎠᎹ ᎢᏥᎶᏨᎯ ᎨᏎᏍᏗ, ᎠᎴ ᏙᎯᏱ ᏂᏨᏁᏍᏗ ᎢᏤᎲᎢ.

source: And he got up, and went into the country of Judaea on the other side of Jordan: and great numbers of people came together to him again; and, as was his way, he gave them teaching.
chr: ᎾᎿᏃ ᏚᎴᏅ, ᏧᏗᏱ ᎦᏓ ᎠᎲᎢ ᎤᎷᏤᎢ, ᏦᏓᏂ ᎠᏍᎪᏂᏗᏢ ᏧᎶᎯᏍᏔᏁᎢ; ᎠᎴ ᎤᏂᏣᏘ ᏴᏫ ᏔᎵᏁ ᎢᎬᏩᏓᏟᏌᏁᎴᎢ; ᎠᎴ ᎢᏳᏛᏁᏗ ᎨᏒ ᏄᏛᏁᎴᎢ, ᏔᎵᏁ ᏚᏪᏲᏁᎢ.

source: And Pharisees came to him, testing him with the question, Is it right for a man to put away his wife?
chr: ᎠᏂᏆᎵᏏᏃ ᎬᏩᎷᏤᎸ ᎬᏩᏛᏛᏁᎢ, ᎯᎠ ᏄᏂᏪᏎᎢ, ᏚᏳᎪᏗᏍᎪ ᎠᏍᎦᏯ ᎤᏓᎢᏅᏗᏱ ᎤᏓᎵᎢ? ᎬᏩᎪᎵᏰᏍᎨᎢ.

source: And he said to them in answer, What did Moses say you were to do?
chr: ᎤᏁᏨᏃ ᎯᎠ ᏂᏑᏪᏎᎴᎢ, ᎦᏙ ᎤᏍᏕ ᎢᏥᏁᏤᎴ ᎼᏏ?

source: And they said to him, Moses let us give her a statement in writing, and be free from her.
chr: ᎯᎠᏃ ᏄᏂᏪᏎᎢ, ᎼᏏ ᎤᎵᏍᎪᎸᏔᏁ ᎪᏪᎶᏗᏱ ᏙᎦᎴᏅᎲᎢ, ᎠᎴ ᎠᏓᎢᏅᏗᏱ.

source: But Jesus said to them, Because of your hard hearts he gave you this law.
chr: ᏥᏌᏃ ᎤᏁᏨ, ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᏗᏍᏓᏱᏳ ᎨᏒ ᎢᏳᏍᏗ ᏗᏥᎾᏫ ᎯᎠ ᎾᏍᎩ ᏗᎧᎿᏩᏛᏍᏗ ᎢᏦᏪᎳᏁᎴᎢ;

source: But from the first, male and female made he them.
chr: ᏗᏓᎴᏂᏍᎬᏍᎩᏂ ᎤᏪᏢᏅᏅᎢ, ᎤᏁᎳᏅᎯ ᎠᏍᎦᏯ ᎠᎴ ᎠᎨᏴ ᏚᏬᏢᏁᎢ.

source: For this cause will a man go away from his father and mother, and be joined to his wife;
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎠᏍᎦᏯ ᏕᎬᏕᎨᏍᏗ ᎤᏙᏓ ᎠᎴ ᎤᏥ, ᎠᎴ ᎤᏓᎵᎢ ᎠᏜᏩᏍᏗᏍᎨᏍᏗ;

source: And the two will become one flesh; so that they are no longer two, but one flesh.
chr: ᎾᏍᎩᏃ ᎠᏂᏔᎵ ᏌᏉᏉ ᎨᏎᏍᏗ ᎤᏂᏇᏓᎸᎢ; ᎾᏍᎩᏃ ᎥᏝ ᎿᏉ ᎠᏂᏔᎵ ᏱᎩ, ᏌᏉᏉᏍᎩᏂ ᎤᏂᏇᏓᎸᎢ.

source: Let not that which has been joined together by God be parted by man.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᏁᎳᏅᎯ ᏧᏭᏓᏔᏅᎯ ᏞᏍᏗ ᏴᏫ ᏧᎦᎴᏅᏔᏅᎩ.

source: And in the house the disciples put questions to him again about this thing.
chr: ᎦᎵᏦᏕᏃ ᎠᏂᏯᎥ ᎬᏩᏍᏓᏩᏗᏙᎯ ᏔᎵᏁ ᎢᎬᏩᏛᏛᏁ ᎾᏍᎩ ᎤᎬᏩᎵ.

source: And he said to them, Whoever puts away his wife and takes another, is false to his wife;
chr: ᎯᎠᏃ ᏂᏚᏪᏎᎴᎢ, ᎩᎶ ᎤᏓᎵᎢ ᎠᏓᎡᎨᏍᏗ, ᎠᎴ ᏅᏩᏓᎴ ᎠᏓᏰᎨᏍᏗ, ᎾᏍᎩ ᎠᏓᏲᏁᎮᏍᏗ ᎠᏍᎦᏅᏤᎮᏍᏗ ᎾᏍᎩ.

source: And if she herself puts away her husband and takes another, she is false to her husband.
chr: ᎢᏳ ᎠᎴ ᎠᎨᏴ ᎤᏰᎯ ᎠᏓᎡᎨᏍᏗ, ᎠᎴ ᏅᏩᏓᎴ ᏓᎾᏤᎨᏍᏗ, ᎾᏍᎩ ᎠᏓᏲᏁᎮᏍᏗ.

source: And they took to him little children, so that he might put his hands on them: and the disciples said sharp words to them.
chr: ᏧᎾᏍᏗᏃ ᏗᏂᏲᎵ ᏕᎬᏩᏘᏃᎮᎴᎢ, ᎾᏍᎩ ᏧᏒᏂᏍᏗᏱ; ᎬᏩᏍᏓᏩᏗᏙᎯᏃ ᏚᏂᎬᏍᎪᎸᏁ ᎾᏍᎩ ᏧᎾᏘᏃᎸᎯ.

source: And when Jesus saw it, he was angry, and said to them, Let the little children come to me, and do not keep them away; for of such is the kingdom of God.
chr: ᏥᏌᏍᎩᏂ ᎤᎪᎲ ᎤᏣᏘ ᏒᏍᎦ ᎤᏰᎸᏁᎢ, ᎠᎴ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎤᏁᎳᎩ ᏕᏤᎵᏎᎮᏍᏗ ᏧᎾᏍᏗ ᏗᏂᏲᎵ ᎬᎩᎷᏤᏗᏱ, ᎠᎴ ᏞᏍᏗ ᏱᏗᏥᏅᏍᏓᏕᎮᏍᏗ; ᎾᏍᎩᏰᏃ ᏄᎾᏍᏗ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎪᎯ.

source: Truly I say to you, Whoever does not put himself under the kingdom of God like a little child, will not come into it at all.
chr: ᎤᏙᎯᏳᎯᏯ ᎯᎠ ᏂᏨᏪᏎᎭ, ᎢᏳᏃ ᎩᎶ ᎤᏁᎳᏅᎯ ᎤᎬᏫᏳᎯ ᎨᏒ ᏂᏓᏓᏂᎸᎬᎾ ᎢᎨᏎᏍᏗ ᎾᏍᎩᏯ ᎠᏲᎵ ᏥᏓᏓᏂᎸᎪᎢ, ᎥᏝ ᎾᎿ ᏱᏮᎬᏴᎭ.

source: And he took them in his arms, and gave them a blessing, putting his hands on them.
chr: ᏚᏁᏒᏃ ᎠᎴ ᏚᏏᏔᏛ, ᎣᏍᏛ ᏚᏁᏤᎴᎢ.

source: And while he was going out into the way, a man came running to him, and went down on his knees, saying, Good Master, what have I to do so that I may have eternal life?
chr: ᎤᏂᎩᏒᏃ ᎦᏅᏅ ᏭᎷᏨ, ᎩᎶ ᎢᏳᏍᏗ ᎤᏗᏠᎡᎸᎩ, ᎠᎴ ᏚᎵᏂᏆᏅᏁᎸᎩ, ᎤᏛᏛᏁ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎰᏍᏛ ᏔᏕᏲᎲᏍᎩ, ᎦᏙ ᏓᎦᏛᏁᎵ ᎤᎵᏍᏆᏗᏍᏗ ᏂᎨᏒᎾ ᎬᏂᏛ ᎠᏆᏤᎵ ᎢᏳᎵᏍᏙᏗᏱ?

source: And Jesus said to him, Why do you say I am good? no one is good but one, and that is God.
chr: ᏥᏌᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎦᏙᏃ ᎰᏍᏛ ᎢᏍᏉᏎᎭ ᎠᏴ? ᎥᏝ ᎩᎶ ᎣᏍᏛ ᏱᎩ, ᏌᏉ ᎤᏩᏒᎯᏳ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ.

source: You have knowledge of what is said in the law, Do not put any one to death, Do not be untrue in married life, Do not take what is not yours, Do not give false witness, Do not get money by deceit, Give honour to your father and mother.
chr: ᏕᎯᎦᏔᎭ ᏗᎧᎿᏩᏛᏍᏗ, ᎾᏍᎩ, ᏞᏍᏗ ᏣᏓᏲᏁᎸᎩ, ᏞᏍᏗ ᏣᏓᎸᎩ, ᏞᏍᏗ ᏣᏃᏍᎩᏒᎩ, ᏞᏍᏗ ᎦᏰᎪᎩ ᏣᏃᎮᎸᎩ, ᏞᏍᏗ ᏣᏓᎶᏄᎮᎸᎩ, ᏣᏙᏓ ᎠᎴ ᏣᏥ ᏕᎯᎸᏉᏕᏍᏗ.

source: And he said to him, Master, all these laws I have kept from the time when I was young.
chr: ᎤᏁᏨᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᏔᏕᏲᎲᏍᎩ, ᎯᎠ ᎾᏍᎩ ᏂᎦᏛ ᏓᎩᏍᏆᏂᎪᏔᏅ ᏥᏧᏣ ᎨᏒ ᏅᏓᎬᏩᏓᎴᏅᏛ.

source: And Jesus, looking on him and loving him, said, There is one thing needed: go, get money for your goods, and give it to the poor, and you will have wealth in heaven: and come with me.
chr: ᏥᏌᏃ ᏚᎧᎿᏅ, ᎤᎨᏳᎯᏳ ᏄᎵᏍᏔᏁᎢ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎴᎢ, ᏑᏓᎴᎩ ᏣᎷᎳ; ᎮᎾ ᏫᎾᏚᎦ ᏂᎦᎥ ᎪᎱᏍᏗ ᏣᎾᎥᎢ, ᎠᎴ ᎤᏲ ᎢᏳᎾᏛᎿᏕᎩ ᎩᏁᎸᎭ, ᏦᏒᏃ ᏫᏣᎮᏍᏗ ᏧᎬᏩᎶᏗ; ᎠᎴ ᏖᏒᎭ, ᏧᏓᎿᏩᏛ ᎯᏴᎲᎭ, ᎠᎴ ᏍᎩᏍᏓᏩᏕᏒᎭ.

source: But his face became sad at the saying, and he went away sorrowing: for he was one who had much property.
chr: ᎤᏲᏃ ᎤᏰᎸᏁ ᎾᏍᎩ ᎾᏥᏪᏎᎸ, ᎠᎴ ᎡᎯᏍᏗ ᎬᏩᏓᏅᏘ ᎤᏓᏅᏎᎢ; ᎤᏣᏘᏰᏃ ᎤᎿᎡᎢ.

source: And Jesus, looking round about, said to his disciples, How hard it is for those who have wealth to come into the kingdom of God!
chr: ᏥᏌᏃ ᎤᏚᏫᏛ ᏚᎧᎿᏂᏙᎸ, ᎯᎠ ᏂᏚᏪᏎᎴ ᎬᏩᏍᏓᏩᏗᏙᎯ, ᎾᏍᏓᏯ ᏧᎬᏩᎶᏗ ᎤᏂᎯ ᎤᏁᎳᎲᎯ ᎤᏤᎵᎪᎯ ᏭᏂᏴᏍᏗᏱ.

source: And the disciples were full of wonder at his words. But Jesus said to them again, Children, how hard it is for those who put faith in wealth to come into the kingdom of God!
chr: ᎬᏩᏍᏓᏩᏗᏙᎯᏃ ᎬᏩᏍᏆᏂᎪᏎᎴ ᎾᏍᎩ ᏄᏪᏒᎢ. ᎠᏎᏃ ᏥᏌ ᏔᎵᏁ ᎢᎤᏁᏨ, ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᏗᏥᏲᎵ. ᎾᏍᏓᏯ ᎾᏍᎩ ᎨᏅᎢᏍᏗ ᎨᏒ ᎠᎾᎵᏍᎦᏍᏙᏗᏍᎩ, ᎤᏁᎳᏅᎯ ᎤᏤᎵᎪᎯ ᏭᏂᏴᏍᏗᏱ.

source: It is simpler for a camel to go through a needle's eye, than for a man of wealth to come into the kingdom of God.
chr: ᎤᏟ ᎠᎯᏗᏳ ᎨᎻᎵ ᏴᎩ ᎦᏌᏁᎾᏛᏗᏱ ᎤᎦᏛᎴᎯᏍᏗᏱ, ᎠᏃ ᎤᏪᎿᎢ ᏴᏫ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎪᎯ ᏭᏴᏍᏗᏱ.

source: And they were greatly surprised, saying to him, Who then may have salvation?
chr: ᎤᎶᏒᏍᏔᏅᎯᏃ ᎤᏂᏍᏆᏂᎪᏍᎨᎢ, ᎯᎠ ᏂᏓᎾᏓᏪᏎᎮᎢ, ᎦᎪᎨ ᏰᎵ ᎦᏰᏥᏍᏕᎸᏗ?

source: Jesus, looking on them, said, With men it is impossible, but not with God: for all things are possible with God.
chr: ᏥᏌᏃ ᎾᏍᎩ ᏚᎧᎿᏅ, ᎯᎠ ᏄᏪᏎᎢ, ᏴᏫ ᎨᏒ ᎾᏍᎩ ᎢᎬᏛᏁᏗ ᏂᎨᏒᎾ, ᎤᏁᎳᏅᎯᏍᎩᏂ ᎨᏒ ᎥᏝ; ᎤᏁᎳᏅᎯᏰᏃ ᎨᏒ ᏂᎦᎥ ᎪᎱᏍᏗ ᎢᎬᏛᏁᏗ.

source: Peter said to him, See, we have given up everything, and come after you.
chr: ᎿᏉᏃ ᏈᏓ ᎤᎴᏅᎮ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎬᏂᏳᏉ ᎠᏴ ᏂᎦᏗᏳ ᎣᎬᏕᏦᏅ, ᎠᎴ ᏂᎯ ᎢᏨᏍᏓᏩᏕᏅ.

source: Jesus said, Truly I say to you, There is no man who has given up house, or brothers, or sisters, or mother, or father, or children, or land, because of me and the good news,
chr: ᏥᏌᏃ ᎤᏁᏨ ᎯᎠ ᏄᏪᏎᎢ; ᎤᏙᎯᏳᎯᏯ ᎯᎠ ᏂᏨᏪᏎᎭ, ᎥᏝ ᎩᎶ ᏰᎭ ᎾᏍᎩ ᎤᏮᏕᏨᎯ ᎢᎨᏎᏍᏗ ᎠᏓᏁᎸᎢ, ᎠᎴ ᎠᎾᎵᏅᏟ, ᎠᎴ ᏧᏙ, ᎠᎴ ᎤᏙᏓ, ᎠᎴ ᎤᏥ, ᎠᎴ ᎤᏓᎵᎢ, ᎠᎴ ᏧᏪᏥ, ᎠᎴ ᏚᎶᎨᏒᎢ, ᎠᏴ ᎨᏒ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᏍᏗ, ᎠᎴ ᎣᏍᏛ ᎧᏃᎮᏛ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᏍᏗ,

source: Who will not get a hundred times as much now in this time, houses, and brothers, and sisters, and mothers, and children, and land--though with great troubles; and, in the world to come, eternal life.
chr: ᎾᏍᎩ ᎪᎯ ᎨᏒ ᎠᏥᏁᏗ ᏂᎨᏒᎾ ᎨᏒ ᎠᏍᎪᎯᏧᏈ ᎢᏳᏩᎫᏗ ᎤᎶᏒᏍᏗ ᏓᏓᏁᎸᎢ, ᎠᎴ ᎠᎾᎵᏅᏟ, ᎠᎴ ᏧᏙ, ᎠᎴ ᏧᏥ, ᎠᎴ ᏧᏪᏥ, ᎠᎴ ᏕᎦᎶᎨᏒᎢ, ᎠᎩᎵᏲᎢᏍᏗ ᎨᏒ ᏔᎵ ᎤᏛᏗ; ᏐᎢᏱᏃ ᏗᎨᏒ ᎤᎵᏍᏆᏗᏍᏗ ᏂᎨᏒᎾ ᎬᏂᏛ.

source: But a great number who are first will be last: and those who are last will be first.
chr: ᎠᏎᏃ ᎤᏂᏣᏔ ᎾᏍᎩ ᎢᎬᏱ ᏥᎩ, ᎣᏂ ᎨᏎᏍᏗ; ᎣᏂᏃ ᏥᎩ, ᎢᎬᏱ ᎨᏎᏍᏗ.

source: And they were on the way, going up to Jerusalem; and Jesus was going before them: and they were full of wonder; but those who came after him were in fear. And again he took the twelve, and gave them word of the things which were to come on him,
chr: ᎦᏅᏅᏃ ᎠᎾᎢᏎ ᏥᎷᏏᎵᎻ ᏣᏂᎦᏖᎢ; ᏥᏌᏃ ᎢᎬᏱ ᏚᏪᏅᎡᎴᎢ; ᎤᏂᏍᏆᏂᎪᏎᏃ; ᎾᏍᎩᏃ ᎠᎾᎵᏍᏓᏩᏗᏒ ᎠᏂᏍᎦᎢᎮᎢ. ᏔᎵᏁᏃ ᏚᏯᏅᎲ ᏔᎳᏚ ᎢᏯᏂᏛ, ᎤᎴᏅᎮ ᏚᏃᏁᎴ ᎾᏍᎩ ᎢᏳᎵᏍᏓᏁᎵᏓᏍᏗ ᎨᏒᎢ.

source: Saying, See, we go up to Jerusalem; and the Son of man will be given up to the chief priests and the scribes; and they will give an order for his death, and will give him up to the Gentiles:
chr: [ᎯᎠ ᏂᎦᏪᏍᎨᎢ;] ᎬᏂᏳᏉ ᏥᎷᏏᎵᎻ ᏫᏗᎦᏘ; ᎠᎴ ᏴᏫ ᎤᏪᏥ ᏙᏓᏰᏥᏲᏏ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ ᎠᏁᎶᎯ ᎠᎴ ᏗᏃᏪᎵᏍᎩ ᏙᏓᎨᏥᏲᎯᏎᎵ; ᎠᎴ ᏙᏓᎬᏭᎪᏓᏁᎵ ᎤᏲᎱᎯᏍᏗᏱ, ᎠᎴ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᏫᏙᏛᏂᏲᎯᏎᎵ;

source: And they will make sport of him, and put shame on him, and give him cruel blows, and will put him to death; and after three days he will come back from the dead.
chr: ᎠᎴ ᏓᎬᏩᏐᏢᎢᏍᏔᏂ, ᎠᎴ ᏓᎬᏩᎵᎥᏂᎵ, ᎠᎴ ᏙᏓᎬᏩᎵᏥᏍᏈ, ᎠᎴ ᏓᎬᏩᎵ; ᏦᎢᏁᏃ ᎢᎦ ᏔᎵᏁ ᏙᏛᎠᎴᏂ.

source: And there came to him James and John, the sons of Zebedee, saying to him, Master, will you give us whatever may be our request?
chr: ᏥᎻᏃ ᎠᎴ ᏣᏂ, ᏤᏈᏗ ᏧᏪᏥ ᎬᏩᎷᏤᎴᎢ, ᎯᎠ ᏄᏂᏪᏎᎢ, ᏔᏕᏲᎲᏍᎩ, ᏍᎩᎾᏚᎵᎭ ᎢᏍᎩᎾᏛᏁᏗᏱ ᏄᏍᏛ ᎢᏍᏛᏔᏲᏎᏗ ᎨᏒᎢ.

source: And he said to them, What would you have me do for you?
chr: ᎯᎠᏃ ᏂᏚᏪᏎᎴᎢ, ᎦᏙᏃ ᎢᏍᏓᏚᎵ ᎢᏍᏛᏯᏛᏁᏗᏱ?

source: And they said to him, Let us be seated, one at your right hand and one at your left, in your glory.
chr: ᎯᎠᏃ ᏂᎬᏩᏪᏎᎴᎢ, ᏍᎩᎾᎵᏍᎪᎸᏓᏏ, ᎾᏍᎩ ᏦᎩᏂᏗᏱ, ᎠᏏᏴᏫ ᎯᎦᏘᏏᏗᏢ, ᏐᎢᏃ ᎯᎦᏍᎦᏂᏗᏢ, ᏣᏤᎵ ᎦᎸᏉᏗᏳ ᎨᏒᎢ.

source: But Jesus said to them, You have no knowledge of what you are saying. Are you able to take of my cup? or to undergo the baptism which I am to undergo?
chr: ᎠᏎᏃ ᏥᏌ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎥᏝ ᏱᏍᏗᎦᏔᎭ ᏄᏍᏛ ᎢᏍᏗᏔᏲᎯᎲᎢ. ᏥᏌ ᏰᎵᏉ ᎨᏍᏓᏗᏔᏍᏗ ᎤᎵᏍᏈᏗ ᎾᏍᎩ ᎠᏆᏗᏔᏍᏗ ᏥᎩ? ᎠᎴ ᏗᎦᏰᏍᏓᏬᏍᏗ ᎾᏍᎩ ᏗᏓᏬᏍᏗ ᎨᏒ ᎾᏍᎩ ᎥᏆᏬᏍᏙᏗ ᏥᎩ?

source: And they said to him, We are able. And Jesus said to them, You will take of the cup from which I take; and the baptism which I am about to undergo you will undergo:
chr: ᎯᎠᏃ ᏂᎬᏩᏪᏎᎴᎢ, ᏰᎵᏉ. ᏥᏌᏃ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎤᏙᎯᏳᎯ ᏓᏍᏓᏗᏔᎯ ᎤᎵᏍᏈᏗ ᎾᏍᎩ ᎠᏴ ᎠᏆᏗᏔᏍᏗ ᏥᎩ, ᎠᎴ ᏗᏓᏬᏍᏗ ᎨᏒ ᎠᏴ ᎥᏆᏬᏍᏙᏗ ᏥᎩ, ᎾᏍᎩ ᏙᏓᏰᏍᏓᏬᏍᏔᏂ;

source: But to be seated at my right hand or at my left is not for me to give: but it is for those for whom it has been made ready.
chr: ᎤᏪᏗᏱᏍᎩᏂ ᎠᏉᎸ ᏥᎦᏘᏏ ᎢᏗᏢ, ᎠᎴ ᏥᎦᏍᎦᏂ ᎢᏗᏢ, ᎥᏝ ᎠᏴ ᎠᏆᏓᏁᏗ ᏱᎩ; ᎤᏅᏒᏍᎩᏂ ᎾᏍᎩ ᎨᎦᏛᏅᎢᏍᏓᏁᎸᎯ ᏥᎩ

source: And hearing this, the ten became very angry with James and John.
chr: ᎠᏍᎪᎯᏃ ᎢᏯᏂᏛ ᎤᎾᏛᎦᏅ, ᎤᎾᎴᏅᎮ ᎤᏣᏘ ᎡᏍᎦ ᏚᏂᏰᎸᎾᏁᎴ ᏥᎻ ᎠᎴ ᏣᏂ.

source: And Jesus made them come to him, and said to them, You see that those who are made rulers over the Gentiles are lords over them, and their great ones have authority over them.
chr: ᎠᏎᏃ ᏥᏌ ᏫᏚᏯᏅᎲ ᎯᎠ ᏂᏚᏪᏎᎴᎢ; ᎢᏥᎦᏔᎭ ᎾᏍᎩ ᎤᏂᎬᏫᏳᎯ ᎨᏥᏰᎸᎢ ᎨᏒ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᏓᏁᏩᏗᏒᎢ, ᏗᎬᏩᎾᏁᎶᏙᏗᏱ ᎾᏅᏁᎰᎢ; ᏧᏂᎸᏉᏗᏃ ᎨᏒ ᎬᏩᎾᏓᎵᏁᎯᏕᎰᎢ.

source: But it is not so among you: but whoever has a desire to become great among you, let him be your servant:
chr: ᏂᎯᏍᎩᏂ ᎢᏤᎲ ᎥᏞᏍᏗ ᎾᏍᎩ ᏱᏂᏨᏁᏍᏗ; ᎩᎶᏍᎩᏂ ᎠᏥᎸᏉᏗ ᎢᏳᎵᏍᏙᏗᏱ ᎤᏚᎵᏍᎨᏍᏗ, ᎾᏍᎩ ᎡᏥᏅᏏᏓᏍᏗ ᎨᏎᏍᏗ.

source: And whoever has a desire to be first among you, let him be servant of all.
chr: ᎠᎴ ᎩᎶ ᏂᎯ ᏂᏣᏛᏅ ᏄᎬᏫᏳᏒ ᎢᏳᎵᏍᏙᏗᏱ ᎤᏚᎵᏍᎨᏍᏗ, ᎾᏍᎩ ᏂᎦᏛ ᎬᏩᏅᏏᏙᎯ ᎨᏎᏍᏗ.

source: For truly the Son of man did not come to have servants, but to be a servant, and to give his life for the salvation of men.
chr: ᎾᏍᏉᏰᏃ ᏴᏫ ᎤᏪᏥ ᎥᏝ ᏳᎷᏨ ᎪᎱᏍᏗ ᎠᎦᏛᏁᏗᏱ, ᎪᎱᏍᏗᏍᎩᏂ ᎤᏓᏛᏁᏗᏱ, ᎠᎴ ᎬᏅ ᏧᏲᎯᏍᏗᏱ ᏧᎫᏴᏙᏗᏱ ᎤᏂᏣᏘ.

source: And they came to Jericho: and when he was going out of Jericho, with his disciples and a great number of people, the son of Timaeus, Bartimaeus, a blind man, was seated by the wayside, with his hand out for money.
chr: ᏤᎵᎪᏃ ᎤᏂᎷᏤᎢ, ᎠᎴ ᎾᏍᎩ ᏤᎵᎪ ᎢᎤᏄᎪᏨ ᎠᎴ ᎾᏍᎩ ᎬᏩᏍᏓᏩᏗᏙᎯ, ᎠᎴ ᎤᏂᏣᏘ ᏴᏫ, ᏗᎨᏫ ᏆᏗᎻᏯ, ᎾᏍᎩ ᏗᎻᏯ ᎤᏪᏥ, ᎤᏬᎴ ᏅᏃᎱᎶᏗ ᎠᏚᎳᏗᏍᎨᎢ.

source: And when it came to his ears that it was Jesus of Nazareth, he gave a cry, and said, Jesus, Son of David, have mercy on me.
chr: ᎤᏛᎦᏅᏃ ᎾᏍᎩ ᏥᏌ ᎾᏎᎵᏗ ᎡᎯ ᎨᏒᎢ, ᎤᎴᏅᎮ ᎤᏪᎷᏁ, ᎯᎠ ᏄᏪᏎᎢ, ᏕᏫ ᎤᏪᏥ, ᏥᏌ, ᏍᎩᏙᎵᎩ.

source: And some of them, turning in protest, gave him an order to be quiet: but he went on crying out all the more, Son of David, have mercy on me.
chr: ᎤᏂᏣᏖᏃ ᎬᏩᎬᏍᎪᎸᏁ ᎬᏩᏁᏤᎴ ᎡᎳᏪᏱ ᎤᏮᏗᏱ; ᎠᏎᏃ ᎤᏟᏉ ᎢᎦᎢ ᎤᏪᎷᏁᎢ, ᏕᏫ ᎤᏪᏥ ᏍᎩᏙᎵᎩ, ᎠᏗᏍᎨᎢ.

source: And Jesus came to a stop and said, Let him come. And crying out to the blind man, they said to him, Be comforted: come, he has sent for you.
chr: ᏥᏌᏃ ᎤᎴᏫᏍᏔᏅ ᎤᏁᏤ ᏩᏥᏯᏅᏗᏱ. ᎤᏂᏯᏅᎮᏃ ᏗᎨᏫ, ᎯᎠ ᏄᏂᏪᏎᎴᎢ, ᎤᎦᎵᏍᏗᏉ ᎭᏓᏅᏓᏓ; ᏔᎴᎲᎦ; ᏗᏣᏯᏂᎭ.

source: And he, putting off his coat, got up quickly, and came to Jesus.
chr: ᎾᏍᎩᏃ ᎤᏓᎢᏅ ᎤᏄᏬ ᏚᎴᏁᎢ, ᎠᎴ ᏥᏌ ᏭᎷᏤᎴᎢ.

source: And Jesus said to him, What would you have me do to you? And the blind man said, Master, make me able to see.
chr: ᏥᏌᏃ ᎤᏁᏨ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎦᏙ ᏣᏚᎵ ᎬᏯᏛᏁᏗᏱ? ᏗᎨᏫᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᏣᎬᏫᏳᎯ, ᎥᎠᎩᎪᏩᏛᏗᏱ [ᎠᏆᏚᎵᎭ.]

source: And Jesus said to him, Go on your way; your faith has made you well. And straight away he was able to see, and went after him in the way.
chr: ᏥᏌᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎮᎾᏉᏃ; ᏦᎯᏳᏒ ᏣᏍᏕᎸ. ᎩᎳᏉᏃ ᎢᏴᏛ ᎬᏩᎪᏩᏛᏗ ᏄᎵᏍᏔᏁᎢ, ᎠᎴ ᎤᏍᏓᏩᏛᏎ ᏥᏌ ᎠᎢᏒᎢ.

source: And when they came near to Jerusalem, to Beth-phage and Bethany, at the Mountain of Olives, he sent two of his disciples,
chr: ᏥᎷᏏᎵᎻᏃ ᎾᎥ ᏭᏂᎷᏨ ᎾᏍᎩ ᏒᎦᏙᎯ ᎠᎴ ᏇᏗᏂᏱ ᎢᏴᏛ, ᎣᎵᏩᏲᎯ ᎤᏌᎯᎸᎢ, ᎠᏂᏔᎵ ᎬᏩᏍᏓᏩᏗᏙᎯ ᏚᏅᏎᎢ,

source: And said to them, Go into the little town opposite: and when you come to it, you will see a young ass with a cord round his neck, on which no man has ever been seated; let him loose, and come back with him.
chr: ᎠᎴ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎢᏍᏕᎾ Ꮎ ᏕᏍᏗᏙᎬ ᏧᏳᎪᏗ ᏨᏗᎦᏚᎭ ᏫᏍᏗᏣᎯ; ᏫᏍᏗᏴᎸᏉᏃ ᎾᎿᏂ, ᏓᏰᏍᏗᏩᏛᎯ ᏗᎦᎵᎠᏅᎯᏛ ᎠᎩᎾ ᎨᎵᏌᏕᏍᏗ, ᎾᏍᎩ ᎥᏝ ᎩᎶ ᏴᏫ ᎤᎩᎸᏔᏅᎯ ᏱᎩ; ᎡᏍᏕᎵᏌᏕᏒᎭ ᎠᎴ ᏤᏍᏓᏘᏁᏒᎭ.

source: And if anyone says to you, Why are you doing this? say, The Lord has need of him and will send him back straight away.
chr: ᎢᏳᏃ ᎩᎶ ᎦᏙᏃ ᎾᏍᎩ ᏂᏍᏓᏛᏁᎭ ᎢᏍᏙᏎᎸᎭ? ᎤᎬᏫᏳᎯ ᎤᏚᎵᎭ, ᎢᏍᏓᏛᏅᎭ; ᎩᎳᏉᏃ ᎢᏴᏛ ᏙᏓᏳᏲᏏ ᎠᏂ ᎡᏍᏓᏘᏃᎯᏍᏗᏱ.

source: And they went away and saw a young ass by the door outside in the open street; and they were getting him loose.
chr: ᎤᏁᏅᏎᏃ, ᎠᎴ ᏭᏂᏩᏛᎮ ᎠᎩᎾ ᎨᎵᏌᏕ ᎦᎶᎯᏍᏗᏳᎶᏗ ᏙᏱᏗᏢ, ᎾᎿ ᏕᎦᏅᏅ ᏓᏠᏍᎬᎢ; ᎤᏁᎵᏌᏕᏎᏃ.

source: And some of those who were there said to them, What are you doing, taking the ass?
chr: ᎩᎶᏃ ᎢᏳᎾᏍᏗ ᎾᎿ ᏗᏂᏙᎩ ᎯᎠ ᏂᏚᏂᏪᏎᎴᎢ, ᎦᏙᏃ ᎢᎡᏍᏕᎵᏌᏕ ᎠᎩᏫ?

source: And they said to them the words which Jesus had said; and they let them go.
chr: ᎠᎴ ᎾᏍᎩᏯᏉ ᏥᏌ ᏄᏪᏒ ᎤᏁᏨ ᏂᏚᏂᏪᏎᎴᎢ: ᏚᏂᏲᏎᏃ.

source: And they took the young ass to Jesus, and put their clothing on him, and he got on his back.
chr: ᎠᎩᎾᏃ ᏥᏌ ᎤᎾᏘᏃᎮᎴᎢ, ᎠᎴ ᏧᎾᏄᏬ ᏚᏂᏢᏁᎴᎢ; ᏥᏌᏃ ᎤᎩᎸᏔᏁᎢ.

source: And a great number put down their clothing in the way; and others put down branches which they had taken from the fields.
chr: ᎤᏂᏣᏖᏃ ᏧᎾᏄᏬ ᏅᏃᎯ ᏚᏄᏰᏍᏛᏁᎢ; ᎢᎦᏛᏃ ᏕᏡᎬ ᏚᏅᏂᎦᎸᎮᎢ, ᎠᎴ ᏅᏃᎯ ᏚᏂᎳᎨᏯᏛᏁᎢ.

source: And those who went in front, and those who came after, were crying, Glory: A blessing on him who comes in the name of the Lord:
chr: ᎢᎬᏱᎢ ᎠᏁᎩ, ᎠᎴ ᎣᏂ ᎠᏁᎩ, ᎤᏁᎷᎨᎢ, ᎯᎠ ᎾᏂᏪᏍᎨᎢ, ᎰᏌᎾ, ᎦᎸᏉᏗᏳ ᎨᏎᏍᏗ ᏱᎰᏩ ᏕᎤᏙᏍᏛ ᏥᎦᎷᎯᏍᏗᏓ.

source: A blessing on the coming kingdom of our father David: Glory in the highest.
chr: ᎦᎸᏉᏗᏳ ᎨᏎᏍᏗ ᏕᏫ ᎢᎩᏙᏓ ᎤᏤᎵ ᎤᎬᏫᏳᎯ ᎨᏒᎢ, ᎾᏍᎩ ᏱᎰᏩ ᏚᏙᏍᏛ ᏥᎦᎷᎯᏍᏗᎭ; ᎰᏌᎾ ᏩᏍᏛ ᎦᎸᎳᏗᏳ.

source: And he went into Jerusalem into the Temple; and after looking round about on all things, it being now evening, he went out to Bethany with the twelve.
chr: ᏥᏌᏃ ᏥᎷᏏᎵᎻ ᏭᏴᎴᎢ, ᎠᎴ ᎤᏔᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ ᏭᏴᎴᎢ; ᎿᏉᏃ ᎬᏩᏚᏫᏛ ᏚᎧᎿᏂᏙᎸ ᏂᎦᏛ ᏧᏓᎴᏅᏛ ᏚᎧᎿᏅ, ᎠᎴ ᎿᏉ ᎤᏒᎯᏴᏱ ᎨᏎᎢ, ᎤᏄᎪᏤ ᏇᏗᏂᏱ ᏭᎶᏎ ᎠᏁᎮ ᏔᎳᏚ ᎢᏯᏂᏛ.

source: And on the day after, when they had come out from Bethany, he was in need of food.
chr: ᎤᎩᏨᏛᏃ ᏇᏗᏂᏱ ᏧᏂᎶᏒ ᎠᎪᏄ ᎤᏲᏏᏍᎨᎢ;

source: And seeing a fig-tree in the distance with leaves, he went to see if by chance it had anything on it: and when he came to it, he saw nothing but leaves, for it was not the time for the fruit.
chr: ᏭᎪᎮᏃ Ꭸ ᎢᏴᏛ ᏗᏡᎨ ᏒᎦᎳᎢᏳᏍᏗ, ᎤᎵᏍᏚᏎᎢ, ᏭᎷᏤᎢ, ᏯᏎᎦᎩ ᏱᏥᏩᏛ ᎪᎱᏍᏗ ᏳᏔ ᎤᏪᎵᏎᎢ; ᎾᎿᏃ ᏭᎷᏨ ᎥᏝ ᎪᎱᏍᏗ ᏳᏩᏛᎮ ᎤᎵᏍᏚᏒᏉ ᎤᏩᏒ; ᎥᏝᏰᏃ ᎠᏏ ᏳᏍᏆᎸᎮ ᏒᎦᏔᎢᏳᎾᏍᏗ ᎤᏅᏂᏍᏗᏱ.

source: And he said to it, Let no man take fruit from you for ever. And his disciples took note of his words.
chr: ᏥᏌᏃ ᎤᏁᏨ ᎯᎠ ᏄᏪᏎᎴᎢ, ᏞᏍᏗ ᎩᎶ ᎢᎸᎯᏳ ᏥᎠᎩ ᏂᎯ ᏣᏓᏔᏅᎯ ᎪᎯ ᎢᏳᏓᎴᏅᏛ. ᎬᏩᏍᏓᏩᏗᏙᎯᏃ ᎤᎾᏛᎦᏁᎢ.

source: And they came to Jerusalem; and he went into the Temple, and sent out those who were trading there, overturning the tables of the money-changers and the seats of those who were offering doves for money;
chr: ᏥᎷᏏᎵᎻᏃ ᎤᏂᎷᏤᎢ; ᏥᏌᏃ ᎤᏔᏅ-ᏗᎦᏔᏫᎢᏍᏗᏱ ᏭᏴᎸ, ᎤᎴᏅᎮ ᏚᏄᎪᏫᏎ ᎠᏂᎾᏕᎩ ᎠᎴ ᎤᏂᏩᎡᎥᏍᎩ ᎾᎿ ᎤᏔᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ, ᎠᎴ ᏚᎷᏆᏗᏅᏎ ᏚᏂᏍᎩᎸ ᎠᏕᎸ ᏗᏂᏟᏴᏍᎩ, ᎠᎴ ᎤᎾᏅᏗᏱ ᎫᎴ-ᏗᏂᏍᎪᏂᎯ ᏗᏂᎾᏕᎩ;
